In [1]:
import pandas as pd

In [2]:
url_2020 = 'http://www.espn.com/nba/salaries/_/seasontype/3'

In [3]:
tables_2020 = pd.read_html(url_2020)
tables_2020

[     0                       1                       2            3
 0   RK                    NAME                    TEAM       SALARY
 1    1       Stephen Curry, PG   Golden State Warriors  $40,231,758
 2    2          Chris Paul, PG   Oklahoma City Thunder  $38,506,482
 3    3   Russell Westbrook, PG         Houston Rockets  $38,506,482
 4    4           John Wall, PG      Washington Wizards  $38,199,000
 5    5        Kevin Durant, SF           Brooklyn Nets  $38,199,000
 6    6        James Harden, SG         Houston Rockets  $38,199,000
 7    7        LeBron James, SF      Los Angeles Lakers  $37,436,858
 8    8          Kyle Lowry, PG         Toronto Raptors  $34,996,296
 9    9       Blake Griffin, PF         Detroit Pistons  $34,449,964
 10  10       Tobias Harris, SF      Philadelphia 76ers  $32,742,000
 11  RK                    NAME                    TEAM       SALARY
 12  11        Jimmy Butler, SF              Miami Heat  $32,742,000
 13  12       Kawhi Leonard, SF             LA Clippers  $32,742,000
 14  13       Klay Thompson, SG   Golden State Warriors  $32,742,000
 15  14        Kemba Walker, PG          Boston Celtics  $32,742,000
 16  15      Gordon Hayward, SF          Boston Celtics  $32,700,690
 17  16         Mike Conley, PG               Utah Jazz  $32,511,624
 18  17        Kyrie Irving, PG           Brooklyn Nets  $31,742,000
 19  18     Khris Middleton, SF         Milwaukee Bucks  $30,603,448
 20  19         Paul George, SG             LA Clippers  $30,560,700
 21  20        Paul Millsap, PF          Denver Nuggets  $30,350,000
 22  RK                    NAME                    TEAM       SALARY
 23  21      Damian Lillard, PG  Portland Trail Blazers  $29,802,321
 24  22          Kevin Love, PF     Cleveland Cavaliers  $28,942,830
 25  23          Al Horford, PF      Philadelphia 76ers  $28,000,000
 26  24       Nikola Vucevic, C           Orlando Magic  $28,000,000
 27  25       DeMar DeRozan, SF       San Antonio Spurs  $27,739,975
 28  26         CJ McCollum, SG  Portland Trail Blazers  $27,556,959
 29  27          Joel Embiid, C      Philadelphia 76ers  $27,504,630
 30  28      Andrew Wiggins, SF  Minnesota Timberwolves  $27,504,630
 31  29         Nikola Jokic, C          Denver Nuggets  $27,504,630
 32  30        Devin Booker, SG            Phoenix Suns  $27,285,000
 33  RK                    NAME                    TEAM       SALARY
 34  31    D'Angelo Russell, SG  Minnesota Timberwolves  $27,285,000
 35  32   Karl-Anthony Towns, C  Minnesota Timberwolves  $27,285,000
 36  33  Kristaps Porzingis, PF        Dallas Mavericks  $27,285,000
 37  34     Otto Porter Jr., SF           Chicago Bulls  $27,250,575
 38  35        Bradley Beal, SG      Washington Wizards  $27,093,019
 39  36       Andre Drummond, C         Detroit Pistons  $27,093,019
 40  37       Anthony Davis, PF      Los Angeles Lakers  $27,093,018
 41  38     Hassan Whiteside, C  Portland Trail Blazers  $27,093,017
 42  39        Jrue Holiday, SG    New Orleans Pelicans  $26,231,111
 43  40   LaMarcus Aldridge, PF       San Antonio Spurs  $26,000,000]

In [14]:
df_2020 = tables_2020[0]
df_2020.columns = ['Rank', 'Player_Position', 'Team', 'Salary']
df_2020 = df_2020.dropna()
df_2020.head()

  Rank        Player_Position                   Team       Salary
0   RK                   NAME                   TEAM       SALARY
1    1      Stephen Curry, PG  Golden State Warriors  $40,231,758
2    2         Chris Paul, PG  Oklahoma City Thunder  $38,506,482
3    3  Russell Westbrook, PG        Houston Rockets  $38,506,482
4    4          John Wall, PG     Washington Wizards  $38,199,000

In [15]:
drop_rows = df_2020[ (df_2020['Rank'] == 'RK') & (df_2020['Player_Position'] == 'NAME') & (df_2020['Team'] == 'TEAM') & (df_2020['Salary'] == 'SALARY')].index
df_2020.drop(drop_rows, inplace=True)
df_2020['Year'] = '2020'
df_2020.head()

  Rank        Player_Position                   Team       Salary  Year
1    1      Stephen Curry, PG  Golden State Warriors  $40,231,758  2020
2    2         Chris Paul, PG  Oklahoma City Thunder  $38,506,482  2020
3    3  Russell Westbrook, PG        Houston Rockets  $38,506,482  2020
4    4          John Wall, PG     Washington Wizards  $38,199,000  2020
5    5       Kevin Durant, SF          Brooklyn Nets  $38,199,000  2020

In [16]:
years = []

for i in range(2000, 2020):
    years.append(i)
years

[2000,
 2001,
 2002,
 2003,
 2004,
 2005,
 2006,
 2007,
 2008,
 2009,
 2010,
 2011,
 2012,
 2013,
 2014,
 2015,
 2016,
 2017,
 2018,
 2019]

In [17]:
# tables_all_others = []
tables_all_others_df = pd.DataFrame()

for year in years:
    url_all_others = f'http://www.espn.com/nba/salaries/_/year/{year}/seasontype/3'
    tables_all_others = pd.read_html(url_all_others)[0]
    tables_all_others['year'] = year
    tables_all_others_df = pd.concat(axis = 0, objs=[tables_all_others, tables_all_others_df])

In [18]:
tables_all_others_df.head()

    0                      1                      2            3  year
0  RK                   NAME                   TEAM       SALARY  2019
1   1      Stephen Curry, PG  Golden State Warriors  $37,457,154  2019
2   2         Chris Paul, PG        Houston Rockets  $35,654,150  2019
3   3       LeBron James, SF     Los Angeles Lakers  $35,654,150  2019
4   4  Russell Westbrook, PG  Oklahoma City Thunder  $35,654,150  2019

In [21]:
tables_all_others_df.columns = ['Rank', 'Player_Position', 'Team', 'Salary', 'Year']
tables_all_others_df = tables_all_others_df.dropna()
drop_rows_others = tables_all_others_df[ (tables_all_others_df['Rank'] == 'RK') & (tables_all_others_df['Player_Position'] == 'NAME') & (tables_all_others_df['Team'] == 'TEAM') & (tables_all_others_df['Salary'] == 'SALARY')].index
tables_all_others_df.drop(drop_rows_others, inplace=True)

In [22]:
tables_all_others_df.head()

  Rank        Player_Position                   Team       Salary  Year
1    1      Stephen Curry, PG  Golden State Warriors  $37,457,154  2019
2    2         Chris Paul, PG        Houston Rockets  $35,654,150  2019
3    3       LeBron James, SF     Los Angeles Lakers  $35,654,150  2019
4    4  Russell Westbrook, PG  Oklahoma City Thunder  $35,654,150  2019
5    5      Blake Griffin, PF        Detroit Pistons  $32,088,932  2019

In [30]:
nba_salaries = pd.concat([df_2020,tables_all_others_df],ignore_index=True)
nba_salaries['Player'], nba_salaries['Position'] = nba_salaries['Player_Position'].str.split(',', 1).str
nba_salaries.drop('Player_Position', axis = 1)
nba_salaries[['Salary']] = nba_salaries[['Salary']].replace('[\$,]','',regex=True).astype(float)
nba_salaries.head()

/Applications/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: FutureWarning: Columnar iteration over characters will be deprecated in future releases.

,Rank,Player_Position,Team,Salary,Year,Player,Position
0,1,"Stephen Curry, PG",Golden State Warriors,40231758.0,2020,Stephen Curry,PG
1,2,"Chris Paul, PG",Oklahoma City Thunder,38506482.0,2020,Chris Paul,PG
2,3,"Russell Westbrook, PG",Houston Rockets,38506482.0,2020,Russell Westbrook,PG
3,4,"John Wall, PG",Washington Wizards,38199000.0,2020,John Wall,PG
4,5,"Kevin Durant, SF",Brooklyn Nets,38199000.0,2020,Kevin Durant,SF

In [27]:
nba_salaries.to_csv('nba_salaries.csv', index=True)